CHO0178/VS/mkl25z4_temp/src/demo/CHO0178/dac_PIT_trig_F.c
#include "wdog.h"
#include "littleHelper.h"
#include "MKL25Z4.h"
#include "sin_lut.h"
/*
DAC
	DAT0L
		DATA0			lower data pro pøevod
	DAT0H
		DATA1			higher data pro pøevod
	C0
		DACEN			povolí použití 12bit DAC


*/
#define PIT_EXPT_PRI		2u
#define PIT0_MOD			3000ul


uint16_t sin_lut_ind;
const uint16_t sin_lut[SIN_LUT_DATA_LEN] = {SIN_LUT_DATA};

void setupNVICandPIT();

int main(void)
{
	wdog_init(WDOG_CONF_LPOCLK_1024_CYCLES);
	// povolte použití 12bit DAC
	DAC0->C0 |= 1<<DAC_C0_DACEN_SHIFT;

	setupNVICandPIT();


	while (1) {
		wdog_refresh();
	}

	return 0;
}


void setupNVICandPIT()
{
	NVIC_SetPriority(PIT_IRQn, PIT_EXPT_PRI);
	NVIC_EnableIRQ(PIT_IRQn);

	PIT->MCR = PIT_MCR_FRZ_MASK;
	PIT->CHANNEL[0u].LDVAL = PIT0_MOD - 1u;
	PIT->CHANNEL[0u].TCTRL = PIT_TCTRL_TIE_MASK | PIT_TCTRL_TEN_MASK;
}

void __attribute__ ((interrupt)) PIT_IRQHandler(void)
{
	PIT->CHANNEL[0u].TFLG = PIT_TFLG_TIF_MASK;

	// vložte hodnoty z sin_lut do registrù DAT0L, DAT0H
	DAC0->DAT[0].DATH = sin_lut[sin_lut_ind]>>8;
	DAC0->DAT[0].DATL = sin_lut[sin_lut_ind];

	// inkrementujte index ukazující na pøíští hodnotu použitou po DAC
	sin_lut_ind++;
	// pøi pøesáhnutí indexu hodnoty SIN_LUT_DATA_LEN vynuluj index
	if (sin_lut_ind == SIN_LUT_DATA_LEN) {
		sin_lut_ind = 0;
	}
}
